tap "oven-sh/bun"

# CLI tools
brew "deno"
brew "eza"
brew "gh"
brew "git"
brew "go"
brew "jq"
brew "ripgrep"
brew "stow"
brew "uv"
brew "zoxide"
brew "bun"

# Editors and terminals
brew "neovim"
cask "wezterm"
cask "zed"

# Browsers
cask "brave-browser"

# Development apps
cask "codex-app"

# Window management and input
cask "flashspace"
cask "karabiner-elements"

# System and productivity
cask "aldente"
cask "raycast"
